ИСПП/src/Documents/ВходнойКонтроль/ВходнойКонтроль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходнойКонтроль</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ИсполнениеЗаявокПредприятий</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченнаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Гриф</name>
    <type>
      <types>CatalogRef.Грифы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПеречню</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Выборка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаПечать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБрак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияПартий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Enums/НастройкиИспользованияСерийНоменклатуры/НастройкиИспользованияСерийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиИспользованияСерийНоменклатуры</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ЭкземплярТовара</name>
  </enumValues>
  <enumValues>
    <name>ПартияТоваров</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Documents/ВходнойКонтроль/ObjectModule.bsl
// Обработка заполнения.
// 
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.ПоступлениеТоваров - Данные заполнения
//  СтандартнаяОбработка - Строка, Неопределено - Стандартная обработка
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = Пользователи.ТекущийПользователь();
		Склад = ДанныеЗаполнения.Склад;
		ПроектЗадания = ДанныеЗаполнения.ЗаказПоставщику.ПроектЗадания;
		ДокументОснование = ДанныеЗаполнения;	
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КоличествоВсего = ТекСтрокаТовары.Количество;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.НомерПоПеречню = ОпределитьНомерПоПеречню(ДанныеЗаполнения.ЗаказПоставщику, НоваяСтрока.Номенклатура);
			НоваяСтрока.Партия = ПолучитьПартиюПоДаннымЗаполнения(ДанныеЗаполнения);
			НоваяСтрока.СтатусУказанияСерий = ТекСтрокаТовары.СтатусУказанияСерий;
			НоваяСтрока.СтатусУказанияПартий = 4;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьНомерПоПеречню(СпецификацияКДоговору, Номенклатура)

	Для Каждого СтрокаТовар Из СпецификацияКДоговору.Товары Цикл
		Если СтрокаТовар.Номенклатура = Номенклатура Тогда
			Возврат СтрокаТовар.НомерСТроки;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
КонецФункции	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеПоддержкаПроектов.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтруктураОтбора = Новый Структура("СтатусУказанияСерий", 6);
	СтрокиССериями = Товары.НайтиСтроки(СтруктураОтбора);
	НоменклатураПоСериям = Товары.Выгрузить(СтрокиССериями);
	НоменклатураПоСериям.Свернуть("Номенклатура, СерияНоменклатуры", "Количество");
	Для Каждого Строка Из НоменклатураПоСериям Цикл
		Если Строка.Количество > 1 И Строка.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для нескольких строк с номенклатурой '" + Строка(Строка.Номенклатура) + "' указана одна и та же серия '" + Строка(Строка.СерияНоменклатуры) + "'.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьПартиюПоДаннымЗаполнения(ДанныеЗаполнения)

	Возврат Справочники.ПартииНоменклатуры.НайтиПоРеквизиту("ДокументОприходования", ДанныеЗаполнения);

КонецФункции	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеПоддержкаПроектов.СформироватьДвиженияПоРегистрам(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Функция СписокРегистровДляКонтроля() Экспорт
	
	РегистрыДляКонтроля = Новый Массив;
	
	Возврат РегистрыДляКонтроля;
	
КонецФункции
